Revit 2026 API

# FailureMessageGetDefaultResolutionCaption Method

---

Retrieves the caption of the default resolution of the failure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetDefaultResolutionCaption()
```
```vb
Public Function GetDefaultResolutionCaption As String
```
```cpp
public:
String^ GetDefaultResolutionCaption()
```
```fsharp
member GetDefaultResolutionCaption : unit -> string
```

#### Return Value

String The caption of the default resolution of the failure.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This FailureMessage does not have any resolutions. |

#### Reference

FailureMessage Class

Autodesk.Revit.DB Namespace